[Killed] BlockStatement
src/entities/WearEvent.ts:18:38
   readonly worn_date: string;
   readonly created_at: Date;
 
-  constructor(props: WearEventProps) {
-    // BR-05
-    if (!props.outfit_id) {
-      throw new Error('WearEvent requires an explicit outfit reference');
-    }
-
-    if (props.items_worn.length === 0) {
-      throw new Error('WearEvent requires at least one item worn');
-    }
-
-    this.wear_event_id = props.wear_event_id;
-    this.user_id = props.user_id;
-    this.outfit_id = props.outfit_id;
-    this.items_worn = Object.freeze([...props.items_worn]);
-    this.worn_date = props.worn_date;
-    this.created_at = props.created_at;
-    Object.freeze(this);
-  }
+  constructor(props: WearEventProps) {}
 }
 
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: expected undefined to be 'outfit-accept' // Object.is equality

[Killed] BooleanLiteral
src/entities/WearEvent.ts:20:9
 
   constructor(props: WearEventProps) {
     // BR-05
-    if (!props.outfit_id) {
+    if (props.outfit_id) {
       throw new Error('WearEvent requires an explicit outfit reference');
     }
killedBy: WearEvent entity creates successfully with explicit outfit reference and items list
statusReason: WearEvent requires an explicit outfit reference

[Killed] ConditionalExpression
src/entities/WearEvent.ts:20:9
 
   constructor(props: WearEventProps) {
     // BR-05
-    if (!props.outfit_id) {
+    if (true) {
       throw new Error('WearEvent requires an explicit outfit reference');
     }
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: WearEvent requires an explicit outfit reference

[NoCoverage] StringLiteral
src/entities/WearEvent.ts:21:23
   constructor(props: WearEventProps) {
     // BR-05
     if (!props.outfit_id) {
-      throw new Error('WearEvent requires an explicit outfit reference');
+      throw new Error("");
     }
 

[Killed] ConditionalExpression
src/entities/WearEvent.ts:24:9
       throw new Error('WearEvent requires an explicit outfit reference');
     }
 
-    if (props.items_worn.length === 0) {
+    if (true) {
       throw new Error('WearEvent requires at least one item worn');
     }
killedBy: SuggestOutfitUseCase — generated ID prefixes acceptOutfit generates a wear_event_id starting with "wear-"
statusReason: WearEvent requires at least one item worn

[Killed] ConditionalExpression
src/entities/WearEvent.ts:24:9
       throw new Error('WearEvent requires an explicit outfit reference');
     }
 
-    if (props.items_worn.length === 0) {
+    if (false) {
       throw new Error('WearEvent requires at least one item worn');
     }
killedBy: WearEvent — empty items_worn guard throws when items_worn is empty
statusReason: expected [Function] to throw an error
