[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:17:31
 // BR-03: minimum items required to form a valid outfit
 const MIN_OUTFIT_ITEMS = 3;
 
-function generateId(): string {
-  return `outfit-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
-}
+function generateId(): string {}
 
 function generateWearEventId(): string {
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:18:34
 const MIN_OUTFIT_ITEMS = 3;
 
 function generateId(): string {
-  return `outfit-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return `outfit-${Date.now()}-${Math.random().toString(36)}`;
 }
 

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:21:40
   return `outfit-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
 }
 
-function generateWearEventId(): string {
-  return `wear-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
-}
+function generateWearEventId(): string {}
 
 /**
killedBy: SuggestOutfitUseCase — generated ID prefixes acceptOutfit generates a wear_event_id starting with "wear-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:22:32
 }
 
 function generateWearEventId(): string {
-  return `wear-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return `wear-${Date.now()}-${Math.random().toString(36)}`;
 }
 

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:28:62
 /**
  * Subtract N days from an ISO date string (YYYY-MM-DD), returns ISO date string.
  */
-function subtractDays(isoDate: string, days: number): string {
-  const d = new Date(`${isoDate}T00:00:00Z`);
-  d.setUTCDate(d.getUTCDate() - days);
-  return d.toISOString().slice(0, 10);
-}
+function subtractDays(isoDate: string, days: number): string {}
 
 /**
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/use-cases/SuggestOutfitUseCase.ts:30:16
  */
 function subtractDays(isoDate: string, days: number): string {
   const d = new Date(`${isoDate}T00:00:00Z`);
-  d.setUTCDate(d.getUTCDate() - days);
+  d.setUTCDate(d.getUTCDate() + days);
   return d.toISOString().slice(0, 10);
 }
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:31:10
 function subtractDays(isoDate: string, days: number): string {
   const d = new Date(`${isoDate}T00:00:00Z`);
   d.setUTCDate(d.getUTCDate() - days);
-  return d.toISOString().slice(0, 10);
+  return d.toISOString();
 }
 

[Timeout] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:37:60
 /**
  * Canonical key for a set of item IDs (order-independent).
  */
-function outfitKey(itemIds: ReadonlyArray<string>): string {
-  return [...itemIds].sort().join(',');
-}
+function outfitKey(itemIds: ReadonlyArray<string>): string {}
 
 export class SuggestOutfitUseCase {

[Survived] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:38:10
  * Canonical key for a set of item IDs (order-independent).
  */
 function outfitKey(itemIds: ReadonlyArray<string>): string {
-  return [...itemIds].sort().join(',');
+  return [...itemIds].join(',');
 }
 

[Survived] StringLiteral
src/use-cases/SuggestOutfitUseCase.ts:38:35
  * Canonical key for a set of item IDs (order-independent).
  */
 function outfitKey(itemIds: ReadonlyArray<string>): string {
-  return [...itemIds].sort().join(',');
+  return [...itemIds].sort().join("");
 }
 

[Killed] BooleanLiteral
src/use-cases/SuggestOutfitUseCase.ts:66:9
   ): Promise<Outfit | null> {
     // BR-01: check wardrobe item count threshold
     const wardrobe = await this.wardrobeRepo.findByUserId(userId);
-    if (!wardrobe || !wardrobe.canSuggestOutfit()) {
+    if (wardrobe || !wardrobe.canSuggestOutfit()) {
       return null;
     }
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:66:9
   ): Promise<Outfit | null> {
     // BR-01: check wardrobe item count threshold
     const wardrobe = await this.wardrobeRepo.findByUserId(userId);
-    if (!wardrobe || !wardrobe.canSuggestOutfit()) {
+    if (true) {
       return null;
     }
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: expected null not to be null

[Survived] ArrowFunction
src/use-cases/SuggestOutfitUseCase.ts:73:14
     // Graceful degradation — proceed even when weather is null
     const weatherContext = await this.weatherService
       .fetchForecast('', date)
-      .catch(() => null);
+      .catch(() => undefined);
 
     // Fetch available items for the occasion

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:79:9
     const season = this.dateToSeason(date);
     const items = await this.itemRepo.findByOccasionAndSeason(wardrobeId, occasion, season);
 
-    if (items.length < MIN_OUTFIT_ITEMS) {
+    if (false) {
       return null;
     }
killedBy: SuggestOutfitUseCase.getDailyOutfit — items < 3 returns null returns null when wardrobe qualifies (>= 5) but fewer than 3 items match the occasion/season
statusReason: Outfit must contain at least 3 items

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:79:42
     const season = this.dateToSeason(date);
     const items = await this.itemRepo.findByOccasionAndSeason(wardrobeId, occasion, season);
 
-    if (items.length < MIN_OUTFIT_ITEMS) {
-      return null;
-    }
+    if (items.length < MIN_OUTFIT_ITEMS) {}
 
     // BR-04: determine rotation window based on wardrobe size
killedBy: SuggestOutfitUseCase.getDailyOutfit — items < 3 returns null returns null when wardrobe qualifies (>= 5) but fewer than 3 items match the occasion/season
statusReason: Outfit must contain at least 3 items

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:85:7
 
     // BR-04: determine rotation window based on wardrobe size
     const windowDays =
-      wardrobe.item_count >= LARGE_WARDROBE_THRESHOLD
+      false
         ? ROTATION_WINDOW_DAYS_LARGE_WARDROBE
         : ROTATION_WINDOW_DAYS_SMALL_WARDROBE;
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/use-cases/SuggestOutfitUseCase.ts:85:7
 
     // BR-04: determine rotation window based on wardrobe size
     const windowDays =
-      wardrobe.item_count >= LARGE_WARDROBE_THRESHOLD
+      wardrobe.item_count < LARGE_WARDROBE_THRESHOLD
         ? ROTATION_WINDOW_DAYS_LARGE_WARDROBE
         : ROTATION_WINDOW_DAYS_SMALL_WARDROBE;
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/use-cases/SuggestOutfitUseCase.ts:91:50
 
     const windowStart = subtractDays(date, windowDays);
     const recentOutfits = await this.outfitRepo.findByDateWindow(userId, windowStart, date);
-    const recentKeys = new Set(recentOutfits.map((o) => outfitKey(o.item_ids)));
+    const recentKeys = new Set(recentOutfits.map(() => undefined));
 
     // Build a candidate outfit — pick first N items whose combination is not in recentKeys
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/use-cases/SuggestOutfitUseCase.ts:94:52
     const recentKeys = new Set(recentOutfits.map((o) => outfitKey(o.item_ids)));
 
     // Build a candidate outfit — pick first N items whose combination is not in recentKeys
-    const selectedIds = this.selectItems(items.map((i) => i.item_id), recentKeys, MIN_OUTFIT_ITEMS);
+    const selectedIds = this.selectItems(items.map(() => undefined), recentKeys, MIN_OUTFIT_ITEMS);
 
     const now = new Date();

[Killed] ObjectLiteral
src/use-cases/SuggestOutfitUseCase.ts:97:31
     const selectedIds = this.selectItems(items.map((i) => i.item_id), recentKeys, MIN_OUTFIT_ITEMS);
 
     const now = new Date();
-    const outfit = new Outfit({
-      outfit_id: generateId(),
-      user_id: userId,
-      item_ids: selectedIds,
-      occasion,
-      weather_context: weatherContext,
-      reasoning: 'Daily suggestion',
-      generated_at: now,
-      suggestion_date: date,
-      status: 'active',
-    });
+    const outfit = new Outfit({});
 
     await this.outfitRepo.save(outfit);
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] StringLiteral
src/use-cases/SuggestOutfitUseCase.ts:103:18
       item_ids: selectedIds,
       occasion,
       weather_context: weatherContext,
-      reasoning: 'Daily suggestion',
+      reasoning: "",
       generated_at: now,
       suggestion_date: date,

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:128:9
     // Align worn_date with the outfit's suggestion_date (test expectation BR-05)
     // Fall back to current date if the outfit cannot be located for any reason.
     let wornDate: string;
-    try {
-      const outfits = await this.outfitRepo.findByUserId(userId);
-      const outfit = outfits.find((o) => o.outfit_id === outfitId);
-      wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
-    } catch {
+    try {} catch {
       wornDate = now.toISOString().slice(0, 10);
     }
killedBy: SuggestOutfitUseCase.acceptOutfit — outfit not found falls back to current date creates a WearEvent with a non-empty worn_date when outfit ID does not exist
statusReason: expected undefined to be truthy

[Killed] EqualityOperator
src/use-cases/SuggestOutfitUseCase.ts:130:42
     let wornDate: string;
     try {
       const outfits = await this.outfitRepo.findByUserId(userId);
-      const outfit = outfits.find((o) => o.outfit_id === outfitId);
+      const outfit = outfits.find((o) => o.outfit_id !== outfitId);
       wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
     } catch {
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: expected '2026-03-01' to be '2026-02-28' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:130:42
     let wornDate: string;
     try {
       const outfits = await this.outfitRepo.findByUserId(userId);
-      const outfit = outfits.find((o) => o.outfit_id === outfitId);
+      const outfit = outfits.find((o) => false);
       wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
     } catch {
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: expected '2026-03-01' to be '2026-02-28' // Object.is equality

[Killed] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:131:45
     try {
       const outfits = await this.outfitRepo.findByUserId(userId);
       const outfit = outfits.find((o) => o.outfit_id === outfitId);
-      wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
+      wornDate = outfit?.suggestion_date ?? now.toISOString();
     } catch {
       wornDate = now.toISOString().slice(0, 10);
killedBy: SuggestOutfitUseCase.acceptOutfit — outfit not found falls back to current date creates a WearEvent with a non-empty worn_date when outfit ID does not exist
statusReason: expected '2026-03-01T09:13:13.413Z' to match /^\d{4}-\d{2}-\d{2}$/

[Killed] LogicalOperator
src/use-cases/SuggestOutfitUseCase.ts:131:18
     try {
       const outfits = await this.outfitRepo.findByUserId(userId);
       const outfit = outfits.find((o) => o.outfit_id === outfitId);
-      wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
+      wornDate = outfit?.suggestion_date && now.toISOString().slice(0, 10);
     } catch {
       wornDate = now.toISOString().slice(0, 10);
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: expected '2026-03-01' to be '2026-02-28' // Object.is equality

[NoCoverage] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:132:13
       const outfits = await this.outfitRepo.findByUserId(userId);
       const outfit = outfits.find((o) => o.outfit_id === outfitId);
       wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
-    } catch {
-      wornDate = now.toISOString().slice(0, 10);
-    }
+    } catch {}
 
     const wearEvent = new WearEvent({

[NoCoverage] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:133:18
       const outfit = outfits.find((o) => o.outfit_id === outfitId);
       wornDate = outfit?.suggestion_date ?? now.toISOString().slice(0, 10);
     } catch {
-      wornDate = now.toISOString().slice(0, 10);
+      wornDate = now.toISOString();
     }
 

[Killed] ObjectLiteral
src/use-cases/SuggestOutfitUseCase.ts:136:37
       wornDate = now.toISOString().slice(0, 10);
     }
 
-    const wearEvent = new WearEvent({
-      wear_event_id: generateWearEventId(),
-      user_id: userId,
-      outfit_id: outfitId,
-      items_worn: finalItemIds,
-      worn_date: wornDate,
-      created_at: now,
-    });
+    const wearEvent = new WearEvent({});
 
     await this.wearEventRepo.save(wearEvent);
killedBy: SuggestOutfitUseCase acceptOutfit — BR-05 creates a WearEvent with the final item IDs provided by the user
statusReason: WearEvent requires an explicit outfit reference

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:155:95
    * BR-08: When an item is deleted, any outfit referencing it must be
    * marked 'invalidated' so it cannot be surfaced again.
    */
-  async invalidateOutfitsForDeletedItem(userId: string, deletedItemId: string): Promise<void> {
-    const allOutfits = await this.outfitRepo.findByUserId(userId);
-
-    for (const outfit of allOutfits) {
-      if (outfit.item_ids.includes(deletedItemId)) {
-        const invalidated = new Outfit({
-          outfit_id: outfit.outfit_id,
-          user_id: outfit.user_id,
-          item_ids: [...outfit.item_ids],
-          occasion: outfit.occasion,
-          weather_context: outfit.weather_context,
-          reasoning: outfit.reasoning,
-          generated_at: outfit.generated_at,
-          suggestion_date: outfit.suggestion_date,
-          status: 'invalidated',
-        });
-        await this.outfitRepo.save(invalidated);
-      }
-    }
-  }
+  async invalidateOutfitsForDeletedItem(userId: string, deletedItemId: string): Promise<void> {}
 
   /**
killedBy: SuggestOutfitUseCase invalidateOutfitsForDeletedItem — BR-08 sets status to invalidated for all outfits referencing the deleted item
statusReason: expected 'active' to be 'invalidated' // Object.is equality

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:158:38
   async invalidateOutfitsForDeletedItem(userId: string, deletedItemId: string): Promise<void> {
     const allOutfits = await this.outfitRepo.findByUserId(userId);
 
-    for (const outfit of allOutfits) {
-      if (outfit.item_ids.includes(deletedItemId)) {
-        const invalidated = new Outfit({
-          outfit_id: outfit.outfit_id,
-          user_id: outfit.user_id,
-          item_ids: [...outfit.item_ids],
-          occasion: outfit.occasion,
-          weather_context: outfit.weather_context,
-          reasoning: outfit.reasoning,
-          generated_at: outfit.generated_at,
-          suggestion_date: outfit.suggestion_date,
-          status: 'invalidated',
-        });
-        await this.outfitRepo.save(invalidated);
-      }
-    }
+    for (const outfit of allOutfits) {}
   }
 
killedBy: SuggestOutfitUseCase invalidateOutfitsForDeletedItem — BR-08 sets status to invalidated for all outfits referencing the deleted item
statusReason: expected 'active' to be 'invalidated' // Object.is equality

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:159:52
     const allOutfits = await this.outfitRepo.findByUserId(userId);
 
     for (const outfit of allOutfits) {
-      if (outfit.item_ids.includes(deletedItemId)) {
-        const invalidated = new Outfit({
-          outfit_id: outfit.outfit_id,
-          user_id: outfit.user_id,
-          item_ids: [...outfit.item_ids],
-          occasion: outfit.occasion,
-          weather_context: outfit.weather_context,
-          reasoning: outfit.reasoning,
-          generated_at: outfit.generated_at,
-          suggestion_date: outfit.suggestion_date,
-          status: 'invalidated',
-        });
-        await this.outfitRepo.save(invalidated);
-      }
+      if (outfit.item_ids.includes(deletedItemId)) {}
     }
   }
killedBy: SuggestOutfitUseCase invalidateOutfitsForDeletedItem — BR-08 sets status to invalidated for all outfits referencing the deleted item
statusReason: expected 'active' to be 'invalidated' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:159:11
     const allOutfits = await this.outfitRepo.findByUserId(userId);
 
     for (const outfit of allOutfits) {
-      if (outfit.item_ids.includes(deletedItemId)) {
+      if (true) {
         const invalidated = new Outfit({
           outfit_id: outfit.outfit_id,
killedBy: SuggestOutfitUseCase invalidateOutfitsForDeletedItem — BR-08 sets status to invalidated for all outfits referencing the deleted item
statusReason: expected 'invalidated' to be 'active' // Object.is equality

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:185:15
     allItemIds: string[],
     recentKeys: Set<string>,
     minCount: number,
-  ): string[] {
-    // Try combinations of increasing size starting from minCount
-    const n = allItemIds.length;
-
-    // Generate combinations of `size` items and pick the first one not in recentKeys
-    for (let size = minCount; size <= n; size++) {
-      const combinations = this.combinations(allItemIds, size);
-      for (const combo of combinations) {
-        const key = outfitKey(combo);
-        if (!recentKeys.has(key)) {
-          return combo;
-        }
-      }
-    }
-
-    // All combinations exhausted — return minimum set (unavoidable repetition)
-    return allItemIds.slice(0, minCount);
-  }
+  ): string[] {}
 
   /**
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:190:50
     const n = allItemIds.length;
 
     // Generate combinations of `size` items and pick the first one not in recentKeys
-    for (let size = minCount; size <= n; size++) {
-      const combinations = this.combinations(allItemIds, size);
-      for (const combo of combinations) {
-        const key = outfitKey(combo);
-        if (!recentKeys.has(key)) {
-          return combo;
-        }
-      }
-    }
+    for (let size = minCount; size <= n; size++) {}
 
     // All combinations exhausted — return minimum set (unavoidable repetition)
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-04 rotation window uses 7-day rotation window when wardrobe has >= 15 items
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:190:31
     const n = allItemIds.length;
 
     // Generate combinations of `size` items and pick the first one not in recentKeys
-    for (let size = minCount; size <= n; size++) {
+    for (let size = minCount; false; size++) {
       const combinations = this.combinations(allItemIds, size);
       for (const combo of combinations) {
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-04 rotation window uses 7-day rotation window when wardrobe has >= 15 items
statusReason: expected true to be false // Object.is equality

[Timeout] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:192:41
     // Generate combinations of `size` items and pick the first one not in recentKeys
     for (let size = minCount; size <= n; size++) {
       const combinations = this.combinations(allItemIds, size);
-      for (const combo of combinations) {
-        const key = outfitKey(combo);
-        if (!recentKeys.has(key)) {
-          return combo;
-        }
-      }
+      for (const combo of combinations) {}
     }
 

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:194:13
       const combinations = this.combinations(allItemIds, size);
       for (const combo of combinations) {
         const key = outfitKey(combo);
-        if (!recentKeys.has(key)) {
+        if (true) {
           return combo;
         }
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/use-cases/SuggestOutfitUseCase.ts:194:13
       const combinations = this.combinations(allItemIds, size);
       for (const combo of combinations) {
         const key = outfitKey(combo);
-        if (!recentKeys.has(key)) {
+        if (recentKeys.has(key)) {
           return combo;
         }
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-04 rotation window skips exact item combinations seen within the 3-day rotation window (<15 items)
statusReason: expected true to be false // Object.is equality

[NoCoverage] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:201:12
     }
 
     // All combinations exhausted — return minimum set (unavoidable repetition)
-    return allItemIds.slice(0, minCount);
+    return allItemIds;
   }
 

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:208:72
    * Generate all combinations of `k` elements from `arr`.
    * Uses a generator to avoid materializing all combinations at once.
    */
-  private *combinations(arr: string[], k: number): Generator<string[]> {
-    if (k === 0) {
-      yield [];
-      return;
-    }
-    for (let i = 0; i <= arr.length - k; i++) {
-      for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {
-        yield [arr[i], ...rest];
-      }
-    }
-  }
+  private *combinations(arr: string[], k: number): Generator<string[]> {}
 
   /**
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-04 rotation window uses 7-day rotation window when wardrobe has >= 15 items
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:209:9
    * Uses a generator to avoid materializing all combinations at once.
    */
   private *combinations(arr: string[], k: number): Generator<string[]> {
-    if (k === 0) {
+    if (true) {
       yield [];
       return;
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: Outfit must contain at least 3 items

[Killed] EqualityOperator
src/use-cases/SuggestOutfitUseCase.ts:209:9
    * Uses a generator to avoid materializing all combinations at once.
    */
   private *combinations(arr: string[], k: number): Generator<string[]> {
-    if (k === 0) {
+    if (k !== 0) {
       yield [];
       return;
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: Outfit must contain at least 3 items

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:213:47
       yield [];
       return;
     }
-    for (let i = 0; i <= arr.length - k; i++) {
-      for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {
-        yield [arr[i], ...rest];
-      }
-    }
+    for (let i = 0; i <= arr.length - k; i++) {}
   }
 
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:213:21
       yield [];
       return;
     }
-    for (let i = 0; i <= arr.length - k; i++) {
+    for (let i = 0; false; i++) {
       for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {
         yield [arr[i], ...rest];
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-04 rotation window uses 7-day rotation window when wardrobe has >= 15 items
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/use-cases/SuggestOutfitUseCase.ts:214:62
       return;
     }
     for (let i = 0; i <= arr.length - k; i++) {
-      for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {
+      for (const rest of this.combinations(arr.slice(i + 1), k + 1)) {
         yield [arr[i], ...rest];
       }
killedBy: SuggestOutfitUseCase.getDailyOutfit — rotation window boundary uses 7-day window for wardrobe with 15 items — outfit from 4 days ago IS excluded
statusReason: expected true to be false // Object.is equality

[Timeout] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:214:70
       return;
     }
     for (let i = 0; i <= arr.length - k; i++) {
-      for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {
-        yield [arr[i], ...rest];
-      }
+      for (const rest of this.combinations(arr.slice(i + 1), k - 1)) {}
     }
   }

[Killed] BlockStatement
src/use-cases/SuggestOutfitUseCase.ts:224:49
    * Map a date to its Northern-Hemisphere season.
    * Used to filter items by season tag when calling ItemRepositoryPort.
    */
-  private dateToSeason(isoDate: string): string {
-    const month = parseInt(isoDate.slice(5, 7), 10);
-    if (month >= 3 && month <= 5) return 'spring';
-    if (month >= 6 && month <= 8) return 'summer';
-    if (month >= 9 && month <= 11) return 'autumn';
-    return 'winter';
-  }
+  private dateToSeason(isoDate: string): string {}
 }
 
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-03-01 (month 03) → 'spring'
statusReason: expected undefined to be 'spring' // Object.is equality

[Killed] MethodExpression
src/use-cases/SuggestOutfitUseCase.ts:225:28
    * Used to filter items by season tag when calling ItemRepositoryPort.
    */
   private dateToSeason(isoDate: string): string {
-    const month = parseInt(isoDate.slice(5, 7), 10);
+    const month = parseInt(isoDate, 10);
     if (month >= 3 && month <= 5) return 'spring';
     if (month >= 6 && month <= 8) return 'summer';
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-03-01 (month 03) → 'spring'
statusReason: expected 'winter' to be 'spring' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:226:9
    */
   private dateToSeason(isoDate: string): string {
     const month = parseInt(isoDate.slice(5, 7), 10);
-    if (month >= 3 && month <= 5) return 'spring';
+    if (true) return 'spring';
     if (month >= 6 && month <= 8) return 'summer';
     if (month >= 9 && month <= 11) return 'autumn';
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-06-01 (month 06) → 'summer'
statusReason: expected 'spring' to be 'summer' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:226:9
    */
   private dateToSeason(isoDate: string): string {
     const month = parseInt(isoDate.slice(5, 7), 10);
-    if (month >= 3 && month <= 5) return 'spring';
+    if (true && month <= 5) return 'spring';
     if (month >= 6 && month <= 8) return 'summer';
     if (month >= 9 && month <= 11) return 'autumn';
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-01-15 (month 01) → 'winter'
statusReason: expected 'spring' to be 'winter' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:227:23
   private dateToSeason(isoDate: string): string {
     const month = parseInt(isoDate.slice(5, 7), 10);
     if (month >= 3 && month <= 5) return 'spring';
-    if (month >= 6 && month <= 8) return 'summer';
+    if (month >= 6 && true) return 'summer';
     if (month >= 9 && month <= 11) return 'autumn';
     return 'winter';
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-09-01 (month 09) → 'autumn'
statusReason: expected 'summer' to be 'autumn' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:227:9
   private dateToSeason(isoDate: string): string {
     const month = parseInt(isoDate.slice(5, 7), 10);
     if (month >= 3 && month <= 5) return 'spring';
-    if (month >= 6 && month <= 8) return 'summer';
+    if (true) return 'summer';
     if (month >= 9 && month <= 11) return 'autumn';
     return 'winter';
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-09-01 (month 09) → 'autumn'
statusReason: expected 'summer' to be 'autumn' // Object.is equality
