[Killed] EqualityOperator
src/use-cases/SuggestOutfitUseCase.ts:228:9
     const month = parseInt(isoDate.slice(5, 7), 10);
     if (month >= 3 && month <= 5) return 'spring';
     if (month >= 6 && month <= 8) return 'summer';
-    if (month >= 9 && month <= 11) return 'autumn';
+    if (month < 9 && month <= 11) return 'autumn';
     return 'winter';
   }
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-09-01 (month 09) → 'autumn'
statusReason: expected 'winter' to be 'autumn' // Object.is equality

[Killed] ConditionalExpression
src/use-cases/SuggestOutfitUseCase.ts:228:9
     const month = parseInt(isoDate.slice(5, 7), 10);
     if (month >= 3 && month <= 5) return 'spring';
     if (month >= 6 && month <= 8) return 'summer';
-    if (month >= 9 && month <= 11) return 'autumn';
+    if (true) return 'autumn';
     return 'winter';
   }
killedBy: SuggestOutfitUseCase.dateToSeason — via findByOccasionAndSeason spy maps 2026-12-01 (month 12) → 'winter'
statusReason: expected 'autumn' to be 'winter' // Object.is equality
