[Killed] BlockStatement
src/entities/Item.ts:56:33
   readonly updated_at: Date;
   readonly status: ItemStatus;
 
-  constructor(props: ItemProps) {
-    this.item_id = props.item_id;
-    this.user_id = props.user_id;
-    this.wardrobe_id = props.wardrobe_id;
-    this.photo_url_original = props.photo_url_original;
-    this.photo_url_thumbnail = props.photo_url_thumbnail;
-    this.name = props.name;
-    this.color_primary = props.color_primary;
-    this.color_hex = props.color_hex;
-    this.category = props.category;
-    this.subcategory = props.subcategory;
-    this.seasons = Object.freeze([...props.seasons]);
-    this.occasions = Object.freeze([...props.occasions]);
-    this.fabric = props.fabric;
-    this.ai_confidence = props.ai_confidence;
-    this.manual_classification = props.manual_classification;
-    this.last_worn_at = props.last_worn_at;
-    this.created_at = props.created_at;
-    this.updated_at = props.updated_at;
-    this.status = props.status;
-    Object.freeze(this);
-  }
+  constructor(props: ItemProps) {}
 }
 
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions generates an item_id starting with "item-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrayDeclaration
src/entities/Item.ts:67:34
     this.color_hex = props.color_hex;
     this.category = props.category;
     this.subcategory = props.subcategory;
-    this.seasons = Object.freeze([...props.seasons]);
+    this.seasons = Object.freeze([]);
     this.occasions = Object.freeze([...props.occasions]);
     this.fabric = props.fabric;
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions copies seasons from classification (not shared reference)
statusReason: expected [] to include 'spring'
