[Killed] BlockStatement
src/entities/Outfit.ts:28:35
   readonly suggestion_date: string;
   readonly status: OutfitStatus;
 
-  constructor(props: OutfitProps) {
-    // BR-03
-    if (props.item_ids.length < 3) {
-      throw new Error('Outfit must contain at least 3 items');
-    }
-
-    this.outfit_id = props.outfit_id;
-    this.user_id = props.user_id;
-    this.item_ids = Object.freeze([...props.item_ids]);
-    this.occasion = props.occasion;
-    this.weather_context = props.weather_context;
-    this.reasoning = props.reasoning;
-    this.generated_at = props.generated_at;
-    this.suggestion_date = props.suggestion_date;
-    this.status = props.status;
-    Object.freeze(this);
-  }
+  constructor(props: OutfitProps) {}
 }
 
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] EqualityOperator
src/entities/Outfit.ts:30:9
 
   constructor(props: OutfitProps) {
     // BR-03
-    if (props.item_ids.length < 3) {
+    if (props.item_ids.length <= 3) {
       throw new Error('Outfit must contain at least 3 items');
     }
killedBy: SuggestOutfitUseCase — generated ID prefixes getDailyOutfit generates an outfit_id starting with "outfit-"
statusReason: Outfit must contain at least 3 items

[Killed] ConditionalExpression
src/entities/Outfit.ts:30:9
 
   constructor(props: OutfitProps) {
     // BR-03
-    if (props.item_ids.length < 3) {
+    if (false) {
       throw new Error('Outfit must contain at least 3 items');
     }
killedBy: Outfit entity raises an error when fewer than 3 items are provided (BR-03)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/entities/Outfit.ts:31:23
   constructor(props: OutfitProps) {
     // BR-03
     if (props.item_ids.length < 3) {
-      throw new Error('Outfit must contain at least 3 items');
+      throw new Error("");
     }
 
killedBy: Outfit entity raises an error when fewer than 3 items are provided (BR-03)
statusReason: expected [Function] to throw error including 'Outfit must contain at least 3 items' but got ''
