[Killed] StringLiteral
src/entities/StyleProfile.ts:5:56
 export type StylePalette = 'neutral' | 'vibrant' | 'monochrome' | 'earthy';
 
 // BR-09: Default calibration values when user skips style setup
-export const DEFAULT_STYLE_ARCHETYPE: StyleArchetype = 'classic';
+export const DEFAULT_STYLE_ARCHETYPE: StyleArchetype = "";
 export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(['work', 'casual']);
 export const DEFAULT_STYLE_PALETTE: StylePalette = 'neutral';
killedBy: CalibrateStyleUseCase skipCalibration persists a StyleProfile with BR-09 defaults: classic / work+casual / neutral
statusReason: expected '' to be 'classic' // Object.is equality

[Killed] StringLiteral
src/entities/StyleProfile.ts:6:88
 
 // BR-09: Default calibration values when user skips style setup
 export const DEFAULT_STYLE_ARCHETYPE: StyleArchetype = 'classic';
-export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(['work', 'casual']);
+export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(["", 'casual']);
 export const DEFAULT_STYLE_PALETTE: StylePalette = 'neutral';
 
killedBy: CalibrateStyleUseCase skipCalibration persists a StyleProfile with BR-09 defaults: classic / work+casual / neutral
statusReason: expected [ '', 'casual' ] to deeply equal [ 'work', 'casual' ]

[Killed] StringLiteral
src/entities/StyleProfile.ts:6:96
 
 // BR-09: Default calibration values when user skips style setup
 export const DEFAULT_STYLE_ARCHETYPE: StyleArchetype = 'classic';
-export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(['work', 'casual']);
+export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(['work', ""]);
 export const DEFAULT_STYLE_PALETTE: StylePalette = 'neutral';
 
killedBy: CalibrateStyleUseCase skipCalibration persists a StyleProfile with BR-09 defaults: classic / work+casual / neutral
statusReason: expected [ 'work', '' ] to deeply equal [ 'work', 'casual' ]

[Killed] StringLiteral
src/entities/StyleProfile.ts:7:52
 // BR-09: Default calibration values when user skips style setup
 export const DEFAULT_STYLE_ARCHETYPE: StyleArchetype = 'classic';
 export const DEFAULT_STYLE_OCCASION_PRIORITIES: ReadonlyArray<string> = Object.freeze(['work', 'casual']);
-export const DEFAULT_STYLE_PALETTE: StylePalette = 'neutral';
+export const DEFAULT_STYLE_PALETTE: StylePalette = "";
 
 export interface EffectivePreferences {
killedBy: CalibrateStyleUseCase skipCalibration persists a StyleProfile with BR-09 defaults: classic / work+casual / neutral
statusReason: expected '' to be 'neutral' // Object.is equality

[Killed] BlockStatement
src/entities/StyleProfile.ts:38:41
   readonly created_at: Date;
   readonly updated_at: Date;
 
-  constructor(props: StyleProfileProps) {
-    this.style_profile_id = props.style_profile_id;
-    this.user_id = props.user_id;
-    this.archetype = props.archetype;
-    this.occasion_priorities = Object.freeze([...props.occasion_priorities]);
-    this.palette = props.palette;
-    this.calibration_completed = props.calibration_completed;
-    this.calibration_version = props.calibration_version;
-    this.created_at = props.created_at;
-    this.updated_at = props.updated_at;
-    Object.freeze(this);
-  }
+  constructor(props: StyleProfileProps) {}
 
   // BR-09: return defaults when calibration has not been completed
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: StyleProfile not found for user user-1

[Killed] BlockStatement
src/entities/StyleProfile.ts:52:48
   }
 
   // BR-09: return defaults when calibration has not been completed
-  effectivePreferences(): EffectivePreferences {
-    if (!this.calibration_completed) {
-      return {
-        archetype: DEFAULT_STYLE_ARCHETYPE,
-        occasion_priorities: DEFAULT_STYLE_OCCASION_PRIORITIES,
-        palette: DEFAULT_STYLE_PALETTE,
-      };
-    }
-    return {
-      archetype: this.archetype,
-      occasion_priorities: this.occasion_priorities,
-      palette: this.palette,
-    };
-  }
+  effectivePreferences(): EffectivePreferences {}
 }
 
killedBy: StyleProfile.effectivePreferences() — calibration_completed=true returns actual archetype, occasions, and palette when calibration is complete
statusReason: Cannot read properties of undefined (reading 'archetype')

[Killed] BooleanLiteral
src/entities/StyleProfile.ts:53:9
 
   // BR-09: return defaults when calibration has not been completed
   effectivePreferences(): EffectivePreferences {
-    if (!this.calibration_completed) {
+    if (this.calibration_completed) {
       return {
         archetype: DEFAULT_STYLE_ARCHETYPE,
killedBy: StyleProfile.effectivePreferences() — calibration_completed=true returns actual archetype, occasions, and palette when calibration is complete
statusReason: expected 'classic' to be 'bold' // Object.is equality

[Killed] ConditionalExpression
src/entities/StyleProfile.ts:53:9
 
   // BR-09: return defaults when calibration has not been completed
   effectivePreferences(): EffectivePreferences {
-    if (!this.calibration_completed) {
+    if (true) {
       return {
         archetype: DEFAULT_STYLE_ARCHETYPE,
killedBy: StyleProfile entity returns stored preferences when calibration is completed
statusReason: expected 'classic' to be 'bold' // Object.is equality
