[Killed] BlockStatement
src/entities/Wardrobe.ts:21:37
   readonly created_at: Date;
   readonly updated_at: Date;
 
-  constructor(props: WardrobeProps) {
-    this.wardrobe_id = props.wardrobe_id;
-    this.user_id = props.user_id;
-    this.item_count = props.item_count;
-    this.first_unlock_achieved = props.first_unlock_achieved;
-    this.created_at = props.created_at;
-    this.updated_at = props.updated_at;
-    Object.freeze(this);
-  }
+  constructor(props: WardrobeProps) {}
 
   // BR-01: Outfit suggestion only possible when wardrobe has at least 5 items
killedBy: Wardrobe entity allows outfit suggestion when item_count is at least 5
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/entities/Wardrobe.ts:32:31
   }
 
   // BR-01: Outfit suggestion only possible when wardrobe has at least 5 items
-  canSuggestOutfit(): boolean {
-    return this.item_count >= 5;
-  }
+  canSuggestOutfit(): boolean {}
 }
 
killedBy: SuggestOutfitUseCase getDailyOutfit — BR-01 proceeds with suggestion when item_count is exactly 5
statusReason: expected null not to be null

[Killed] EqualityOperator
src/entities/Wardrobe.ts:33:12
 
   // BR-01: Outfit suggestion only possible when wardrobe has at least 5 items
   canSuggestOutfit(): boolean {
-    return this.item_count >= 5;
+    return this.item_count > 5;
   }
 }
killedBy: Wardrobe entity allows outfit suggestion when item_count is at least 5
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/entities/Wardrobe.ts:33:12
 
   // BR-01: Outfit suggestion only possible when wardrobe has at least 5 items
   canSuggestOutfit(): boolean {
-    return this.item_count >= 5;
+    return true;
   }
 }
killedBy: Wardrobe entity returns null for outfit suggestion when item_count is below 5
statusReason: expected true to be false // Object.is equality
