[Killed] BlockStatement
src/use-cases/CalibrateStyleUseCase.ts:10:31
 import type { StyleArchetype, StylePalette } from '../entities/StyleProfile.js';
 import type { StyleProfileRepositoryPort } from '../ports/outbound/StyleProfileRepositoryPort.js';
 
-function generateId(): string {
-  return `sp-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
-}
+function generateId(): string {}
 
 export class CalibrateStyleUseCase {
killedBy: CalibrateStyleUseCase.skipCalibration — ID format generates a style_profile_id starting with "sp-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/use-cases/CalibrateStyleUseCase.ts:11:30
 import type { StyleProfileRepositoryPort } from '../ports/outbound/StyleProfileRepositoryPort.js';
 
 function generateId(): string {
-  return `sp-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return `sp-${Date.now()}-${Math.random().toString(36)}`;
 }
 

[Killed] StringLiteral
src/use-cases/CalibrateStyleUseCase.ts:11:10
 import type { StyleProfileRepositoryPort } from '../ports/outbound/StyleProfileRepositoryPort.js';
 
 function generateId(): string {
-  return `sp-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return ``;
 }
 
killedBy: CalibrateStyleUseCase.skipCalibration — ID format generates a style_profile_id starting with "sp-"
statusReason: expected '' to match /^sp-/

[Killed] BlockStatement
src/use-cases/CalibrateStyleUseCase.ts:21:64
    * Skip calibration — persist a StyleProfile with BR-09 defaults.
    * calibration_completed is false; effectivePreferences() will return defaults.
    */
-  async skipCalibration(userId: string): Promise<StyleProfile> {
-    const now = new Date();
-    const profile = new StyleProfile({
-      style_profile_id: generateId(),
-      user_id: userId,
-      archetype: DEFAULT_STYLE_ARCHETYPE,
-      occasion_priorities: [...DEFAULT_STYLE_OCCASION_PRIORITIES],
-      palette: DEFAULT_STYLE_PALETTE,
-      calibration_completed: false,
-      calibration_version: 0,
-      created_at: now,
-      updated_at: now,
-    });
-
-    await this.styleProfileRepo.save(profile);
-    return profile;
-  }
+  async skipCalibration(userId: string): Promise<StyleProfile> {}
 
   /**
killedBy: CalibrateStyleUseCase.completeCalibration — existing profile reuses the existing style_profile_id when completing over a skipped profile
statusReason: Cannot read properties of undefined (reading 'style_profile_id')

[Killed] BooleanLiteral
src/use-cases/CalibrateStyleUseCase.ts:29:30
       archetype: DEFAULT_STYLE_ARCHETYPE,
       occasion_priorities: [...DEFAULT_STYLE_OCCASION_PRIORITIES],
       palette: DEFAULT_STYLE_PALETTE,
-      calibration_completed: false,
+      calibration_completed: true,
       calibration_version: 0,
       created_at: now,
killedBy: CalibrateStyleUseCase skipCalibration persists a StyleProfile with BR-09 defaults: classic / work+casual / neutral
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/use-cases/CalibrateStyleUseCase.ts:48:28
     archetype: StyleArchetype,
     occasions: string[],
     palette: StylePalette,
-  ): Promise<StyleProfile> {
-    const now = new Date();
-    const existing = await this.styleProfileRepo.findByUserId(userId);
-    const profile = new StyleProfile({
-      style_profile_id: existing?.style_profile_id ?? generateId(),
-      user_id: userId,
-      archetype,
-      occasion_priorities: occasions,
-      palette,
-      calibration_completed: true,
-      calibration_version: (existing?.calibration_version ?? 0) + 1,
-      created_at: existing?.created_at ?? now,
-      updated_at: now,
-    });
-
-    await this.styleProfileRepo.save(profile);
-    return profile;
-  }
+  ): Promise<StyleProfile> {}
 
   /**
killedBy: CalibrateStyleUseCase completeCalibration persists a StyleProfile with user-chosen archetype, occasions, and palette
statusReason: Cannot read properties of undefined (reading 'archetype')

[Killed] OptionalChaining
src/use-cases/CalibrateStyleUseCase.ts:52:25
     const now = new Date();
     const existing = await this.styleProfileRepo.findByUserId(userId);
     const profile = new StyleProfile({
-      style_profile_id: existing?.style_profile_id ?? generateId(),
+      style_profile_id: existing.style_profile_id ?? generateId(),
       user_id: userId,
       archetype,
killedBy: CalibrateStyleUseCase completeCalibration persists a StyleProfile with user-chosen archetype, occasions, and palette
statusReason: Cannot read properties of null (reading 'style_profile_id')

[Killed] LogicalOperator
src/use-cases/CalibrateStyleUseCase.ts:52:25
     const now = new Date();
     const existing = await this.styleProfileRepo.findByUserId(userId);
     const profile = new StyleProfile({
-      style_profile_id: existing?.style_profile_id ?? generateId(),
+      style_profile_id: existing?.style_profile_id && generateId(),
       user_id: userId,
       archetype,
killedBy: CalibrateStyleUseCase.completeCalibration — existing profile reuses the existing style_profile_id when completing over a skipped profile
statusReason: expected 'sp-1772356378263-z6cgv3w' to be 'sp-1772356378263-xztd125' // Object.is equality

[Killed] BooleanLiteral
src/use-cases/CalibrateStyleUseCase.ts:57:30
       archetype,
       occasion_priorities: occasions,
       palette,
-      calibration_completed: true,
+      calibration_completed: false,
       calibration_version: (existing?.calibration_version ?? 0) + 1,
       created_at: existing?.created_at ?? now,
killedBy: CalibrateStyleUseCase completeCalibration persists a StyleProfile with user-chosen archetype, occasions, and palette
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/use-cases/CalibrateStyleUseCase.ts:58:28
       occasion_priorities: occasions,
       palette,
       calibration_completed: true,
-      calibration_version: (existing?.calibration_version ?? 0) + 1,
+      calibration_version: (existing?.calibration_version ?? 0) - 1,
       created_at: existing?.created_at ?? now,
       updated_at: now,
killedBy: CalibrateStyleUseCase.completeCalibration — existing profile increments calibration_version from 0 to 1 on first completion
statusReason: expected -1 to be 1 // Object.is equality

[Killed] OptionalChaining
src/use-cases/CalibrateStyleUseCase.ts:58:29
       occasion_priorities: occasions,
       palette,
       calibration_completed: true,
-      calibration_version: (existing?.calibration_version ?? 0) + 1,
+      calibration_version: (existing.calibration_version ?? 0) + 1,
       created_at: existing?.created_at ?? now,
       updated_at: now,
killedBy: CalibrateStyleUseCase.updateStyleProfile throws when no StyleProfile exists for user
statusReason: Cannot read properties of null (reading 'calibration_version')

[Killed] OptionalChaining
src/use-cases/CalibrateStyleUseCase.ts:59:19
       palette,
       calibration_completed: true,
       calibration_version: (existing?.calibration_version ?? 0) + 1,
-      created_at: existing?.created_at ?? now,
+      created_at: existing.created_at ?? now,
       updated_at: now,
     });
killedBy: CalibrateStyleUseCase.updateStyleProfile throws when no StyleProfile exists for user
statusReason: Cannot read properties of null (reading 'created_at')

[Survived] LogicalOperator
src/use-cases/CalibrateStyleUseCase.ts:59:19
       palette,
       calibration_completed: true,
       calibration_version: (existing?.calibration_version ?? 0) + 1,
-      created_at: existing?.created_at ?? now,
+      created_at: existing?.created_at && now,
       updated_at: now,
     });

[Killed] BlockStatement
src/use-cases/CalibrateStyleUseCase.ts:77:28
       occasion_priorities: string[];
       palette: StylePalette;
     }>,
-  ): Promise<StyleProfile> {
-    const existing = await this.styleProfileRepo.findByUserId(userId);
-    if (!existing) {
-      throw new Error(`StyleProfile not found for user ${userId}`);
-    }
-
-    const now = new Date();
-    const profile = new StyleProfile({
-      style_profile_id: existing.style_profile_id,
-      user_id: existing.user_id,
-      archetype: updates.archetype ?? existing.archetype,
-      occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
-      palette: updates.palette ?? existing.palette,
-      calibration_completed: existing.calibration_completed,
-      calibration_version: existing.calibration_version + 1,
-      created_at: existing.created_at,
-      updated_at: now,
-    });
-
-    await this.styleProfileRepo.save(profile);
-    return profile;
-  }
+  ): Promise<StyleProfile> {}
 }
 
killedBy: CalibrateStyleUseCase.updateStyleProfile throws when no StyleProfile exists for user
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/use-cases/CalibrateStyleUseCase.ts:79:20
     }>,
   ): Promise<StyleProfile> {
     const existing = await this.styleProfileRepo.findByUserId(userId);
-    if (!existing) {
-      throw new Error(`StyleProfile not found for user ${userId}`);
-    }
+    if (!existing) {}
 
     const now = new Date();
killedBy: CalibrateStyleUseCase.updateStyleProfile throws when no StyleProfile exists for user
statusReason: expected [Function] to throw error matching /StyleProfile not found for user nonex…/ but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/use-cases/CalibrateStyleUseCase.ts:79:9
     }>,
   ): Promise<StyleProfile> {
     const existing = await this.styleProfileRepo.findByUserId(userId);
-    if (!existing) {
+    if (true) {
       throw new Error(`StyleProfile not found for user ${userId}`);
     }
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: StyleProfile not found for user user-1

[Killed] ObjectLiteral
src/use-cases/CalibrateStyleUseCase.ts:84:38
     }
 
     const now = new Date();
-    const profile = new StyleProfile({
-      style_profile_id: existing.style_profile_id,
-      user_id: existing.user_id,
-      archetype: updates.archetype ?? existing.archetype,
-      occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
-      palette: updates.palette ?? existing.palette,
-      calibration_completed: existing.calibration_completed,
-      calibration_version: existing.calibration_version + 1,
-      created_at: existing.created_at,
-      updated_at: now,
-    });
+    const profile = new StyleProfile({});
 
     await this.styleProfileRepo.save(profile);
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: props.occasion_priorities is not iterable

[Killed] LogicalOperator
src/use-cases/CalibrateStyleUseCase.ts:87:18
     const profile = new StyleProfile({
       style_profile_id: existing.style_profile_id,
       user_id: existing.user_id,
-      archetype: updates.archetype ?? existing.archetype,
+      archetype: updates.archetype && existing.archetype,
       occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
       palette: updates.palette ?? existing.palette,
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: expected 'bold' to be 'minimalist' // Object.is equality

[Killed] LogicalOperator
src/use-cases/CalibrateStyleUseCase.ts:88:28
       style_profile_id: existing.style_profile_id,
       user_id: existing.user_id,
       archetype: updates.archetype ?? existing.archetype,
-      occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
+      occasion_priorities: updates.occasion_priorities && [...existing.occasion_priorities],
       palette: updates.palette ?? existing.palette,
       calibration_completed: existing.calibration_completed,
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: props.occasion_priorities is not iterable

[Killed] LogicalOperator
src/use-cases/CalibrateStyleUseCase.ts:89:16
       user_id: existing.user_id,
       archetype: updates.archetype ?? existing.archetype,
       occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
-      palette: updates.palette ?? existing.palette,
+      palette: updates.palette && existing.palette,
       calibration_completed: existing.calibration_completed,
       calibration_version: existing.calibration_version + 1,
killedBy: CalibrateStyleUseCase.updateStyleProfile updates archetype while preserving palette and occasions
statusReason: expected undefined to be 'vibrant' // Object.is equality

[Killed] ArithmeticOperator
src/use-cases/CalibrateStyleUseCase.ts:91:28
       occasion_priorities: updates.occasion_priorities ?? [...existing.occasion_priorities],
       palette: updates.palette ?? existing.palette,
       calibration_completed: existing.calibration_completed,
-      calibration_version: existing.calibration_version + 1,
+      calibration_version: existing.calibration_version - 1,
       created_at: existing.created_at,
       updated_at: now,
killedBy: CalibrateStyleUseCase.updateStyleProfile increments calibration_version by exactly 1
statusReason: expected +0 to be 2 // Object.is equality
