[Killed] BlockStatement
src/use-cases/DigitizeItemUseCase.ts:10:31
 import type { ConsentLogPort } from '../ports/outbound/ConsentLogPort.js';
 import type { AIQualityLogPort } from '../ports/outbound/AIQualityLogPort.js';
 
-function generateId(): string {
-  return `item-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
-}
+function generateId(): string {}
 
 export class DigitizeItemUseCase {
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions generates an item_id starting with "item-"
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/use-cases/DigitizeItemUseCase.ts:11:32
 import type { AIQualityLogPort } from '../ports/outbound/AIQualityLogPort.js';
 
 function generateId(): string {
-  return `item-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return `item-${Date.now()}-${Math.random().toString(36)}`;
 }
 

[Killed] StringLiteral
src/use-cases/DigitizeItemUseCase.ts:11:10
 import type { AIQualityLogPort } from '../ports/outbound/AIQualityLogPort.js';
 
 function generateId(): string {
-  return `item-${Date.now()}-${Math.random().toString(36).slice(2, 9)}`;
+  return ``;
 }
 
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions generates an item_id starting with "item-"
statusReason: expected '' to match /^item-/

[Killed] BooleanLiteral
src/use-cases/DigitizeItemUseCase.ts:38:9
     imageBuffer: Buffer,
   ): Promise<Item> {
     const granted = await this.consentLog.isConsentGranted(userId);
-    if (!granted) {
+    if (granted) {
       throw new Error(`User ${userId} has not granted photo storage consent`);
     }
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions generates an item_id starting with "item-"
statusReason: User user-1 has not granted photo storage consent

[Killed] ConditionalExpression
src/use-cases/DigitizeItemUseCase.ts:38:9
     imageBuffer: Buffer,
   ): Promise<Item> {
     const granted = await this.consentLog.isConsentGranted(userId);
-    if (!granted) {
+    if (true) {
       throw new Error(`User ${userId} has not granted photo storage consent`);
     }
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions generates an item_id starting with "item-"
statusReason: User user-1 has not granted photo storage consent

[Killed] BooleanLiteral
src/use-cases/DigitizeItemUseCase.ts:70:30
       occasions: [...classification.occasions],
       fabric: classification.fabric,
       ai_confidence: classification.ai_confidence,
-      manual_classification: false,
+      manual_classification: true,
       last_worn_at: null,
       created_at: now,
killedBy: DigitizeItemUseCase.initiateDigitization — property assertions sets manual_classification to false (AI-classified)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/use-cases/DigitizeItemUseCase.ts:87:68
    * item_count is maintained by a DB trigger — the use case does NOT call
    * wardrobeRepo.updateItemCount (BR-06 note: pending items excluded from count).
    */
-  async confirmItem(userId: string, itemId: string): Promise<Item> {
-    const existing = await this.itemRepo.findById(itemId);
-    if (!existing) {
-      throw new Error(`Item ${itemId} not found`);
-    }
-
-    const now = new Date();
-    const confirmed = new Item({
-      ...this.itemToProps(existing),
-      status: 'active',
-      updated_at: now,
-    });
-
-    await this.itemRepo.save(confirmed);
-    return confirmed;
-  }
+  async confirmItem(userId: string, itemId: string): Promise<Item> {}
 
   /**
killedBy: DigitizeItemUseCase.confirmItem — error path throws when item ID does not exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/use-cases/DigitizeItemUseCase.ts:89:9
    */
   async confirmItem(userId: string, itemId: string): Promise<Item> {
     const existing = await this.itemRepo.findById(itemId);
-    if (!existing) {
+    if (false) {
       throw new Error(`Item ${itemId} not found`);
     }
killedBy: DigitizeItemUseCase.confirmItem — error path throws when item ID does not exist
statusReason: expected [Function] to throw error matching /ghost-item/ but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/use-cases/DigitizeItemUseCase.ts:89:20
    */
   async confirmItem(userId: string, itemId: string): Promise<Item> {
     const existing = await this.itemRepo.findById(itemId);
-    if (!existing) {
-      throw new Error(`Item ${itemId} not found`);
-    }
+    if (!existing) {}
 
     const now = new Date();
killedBy: DigitizeItemUseCase.confirmItem — error path throws when item ID does not exist
statusReason: expected [Function] to throw error matching /ghost-item/ but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/use-cases/DigitizeItemUseCase.ts:117:9
     correctedSubcategory: string,
   ): Promise<Item> {
     const existing = await this.itemRepo.findById(itemId);
-    if (!existing) {
+    if (true) {
       throw new Error(`Item ${itemId} not found`);
     }
killedBy: DigitizeItemUseCase correctMetadata logs the predicted and corrected classification via AIQualityLogPort (BR-10)
statusReason: Item item-correct not found

[Survived] LogicalOperator
src/use-cases/DigitizeItemUseCase.ts:131:22
       seasons: [...existing.seasons],
       occasions: [...existing.occasions],
       fabric: existing.fabric,
-      ai_confidence: existing.ai_confidence ?? 0,
+      ai_confidence: existing.ai_confidence && 0,
     });
 

[Survived] ArrayDeclaration
src/use-cases/DigitizeItemUseCase.ts:141:18
       category: correctedCategory,
       subcategory: correctedSubcategory,
       seasons: [...existing.seasons],
-      occasions: [...existing.occasions],
+      occasions: [],
       fabric: existing.fabric,
       ai_confidence: existing.ai_confidence ?? 0,

[Killed] BooleanLiteral
src/use-cases/DigitizeItemUseCase.ts:154:30
       ...this.itemToProps(existing),
       category: correctedCategory,
       subcategory: correctedSubcategory,
-      manual_classification: true,
+      manual_classification: false,
       updated_at: now,
     });
killedBy: DigitizeItemUseCase correctMetadata updates item category and subcategory after correction
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/use-cases/DigitizeItemUseCase.ts:166:67
    * Delete an item from the wardrobe.
    * item_count is decremented by a DB trigger — no manual decrement here.
    */
-  async deleteItem(userId: string, itemId: string): Promise<void> {
-    await this.itemRepo.delete(itemId);
-  }
+  async deleteItem(userId: string, itemId: string): Promise<void> {}
 
   private itemToProps(item: Item) {
killedBy: DigitizeItemUseCase.deleteItem removes the item from the repository
statusReason: expected { Object (item_id, user_id, ...) } to be undefined

[Killed] BlockStatement
src/use-cases/DigitizeItemUseCase.ts:170:35
     await this.itemRepo.delete(itemId);
   }
 
-  private itemToProps(item: Item) {
-    return {
-      item_id: item.item_id,
-      user_id: item.user_id,
-      wardrobe_id: item.wardrobe_id,
-      photo_url_original: item.photo_url_original,
-      photo_url_thumbnail: item.photo_url_thumbnail,
-      name: item.name,
-      color_primary: item.color_primary,
-      color_hex: item.color_hex,
-      category: item.category,
-      subcategory: item.subcategory,
-      seasons: [...item.seasons],
-      occasions: [...item.occasions],
-      fabric: item.fabric,
-      ai_confidence: item.ai_confidence,
-      manual_classification: item.manual_classification,
-      last_worn_at: item.last_worn_at,
-      created_at: item.created_at,
-      updated_at: item.updated_at,
-      status: item.status,
-    };
-  }
+  private itemToProps(item: Item) {}
 }
 
killedBy: DigitizeItemUseCase confirmItem transitions item status from pending_ai to active
statusReason: props.seasons is not iterable

[Survived] ArrayDeclaration
src/use-cases/DigitizeItemUseCase.ts:183:18
       category: item.category,
       subcategory: item.subcategory,
       seasons: [...item.seasons],
-      occasions: [...item.occasions],
+      occasions: [],
       fabric: item.fabric,
       ai_confidence: item.ai_confidence,
